// Напишите программу ,которая на вход принимает два числа и выдаёт. какое число больше, а какое меньше.
// a = 1, b = 3 -> max = 7
// a = 2; b = 10 -> max = 10
// a = -9; b = -3 -> max = -3



Console.Clear();
Console.Write("Введите трехзначное число: ");
int num1 = Convert.ToInt32(Console.ReadLine());