// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2,3,7 -> 7
// 44,5,78 -> 78



Console.Clear();
Console.Write("Введите трехзначное число: ");
int num1 = Convert.ToInt32(Console.ReadLine());
